Revit 2027 API
DisciplineTypeId.Hvac Property
 HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Hvac { get; }
Public Shared ReadOnly Property Hvac As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Hvac {
	ForgeTypeId^ get ();
}
static member Hvac : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
DisciplineTypeId Class
Autodesk.Revit.DB Namespace